
define([], function(){
	return {
		errorCode: {

			'-1': '服务故障，请稍后再试',
			1: '用户名或密码错误',

			/******************************************/

			1001: '服务故障，请稍后再试',
			1001: '手机号码格式错误',
			1002: '密码格式错误',
			1003: '联系人格式错误',
			1004: '办公地址格式错误',

			1021: '请输入图片验证码',
			1022: '用户名或密码错误',
				
			/*******************************************/

			2001: '用户名或密码错误',
			
			/*******************************************/
			100000000: '系统异常',
			100000017: '请输入手机号码',
			103001001: '请输入短信验证码',
			103001002: '短信验证码不存在或已失效，请重新获取',
			103001003: '验证码输入不正确，请重新输入',
			100000015: '请输入密码',
			100000001: '数据格式有误',
			101001009: '该手机号已被注册',
			101001004: '新密码不能与现密码相同',
			103001009: '操作已超时，请重新操作',
			100000010: '操作失败，请重试',

			100000020: '用户名或密码错误',
			100000004: '用户未登录',
			101001002: '该用户不是会员',
			101001003: '登陆成功，是会员',

			101004003: '该工商注册号已被注册',
			103001012: '该用户已经申请过会员',
			100000008: '申请会员失败',

			103001005: '请输入图片验证码',
			103001006: '验证码已失效，请刷新验证码获取',
			

			
			//100000004: function(){ window.location.href = '/'},
			100000005: '手机验证码错误',
			100000006: '该手机号已被注册',

			
			103001004: '短信验证码发送失败',
			100000003: '该用户不存在',
			100000010: '修改失败',
			101004004: '该企业已注册',

			/*******************************************/
			102001002: '数据不存在',
			100000001: '数据格式有误',
			102001010: '贷款金额超过限额',
			
			103001007: '该合作厂家已存在',
			101003001: '合作厂商已经审核通过',
			100000013: '资料上传失败',
			100006014: '资料上传过于频繁，请一分钟后再试',
			100006015: '上传资料仅接收jpg、jpeg、gif、bmp、png格式',
			100006016: '上传资料不能超过5MB',
			100000012: '删除失败'

			/*******************************************/

		},

		blackList: {
			102001003: '该省份已经存在黑名单中',
			102001004: '该市区已经存在黑名单中',
			102001005: '该项目已经存在黑名单中',
			102001001: '贷款申请失败'
		},

		parterModel: {
			'电梯系统': 1,
			'空调设备': 2,
			'厨房电器': 3
		},

		parterModelNum: {
			'1': '电梯系统',
			'2': '空调设备',
			'3': '厨房电器'
		}
	}
})